
a1 = 1.5
b1 = '12'
c1 = False
print("将浮点数转化为整数:",int(a1)) #去掉小数点后面的内容
print("将数字字符串转化为整数:",int(b1)) # int() 不能解析浮点数字符串
print("将布尔值转化为整数:",int(c1)) #True：1 False：0

a2 = 10
b2 = '12.3'
print("将浮点数转化为浮点数:",float(a2))
print("将数字字符串转化为浮点数:",float(b2))

a3 = 10
b3 = True
# print("a3=" + 10) 10不是字符串，（只有字符串和字符串可以相加，其余内容不可以）
print("将整数转化为字符串:",str(a3))
print("将布尔值转化为字符串:",str(b3) + '字符串')
print("a3=" + str(10))

a4 = "12 + 71" # 字符串表达式
#eval(字符串的表达式) 直接运行出表达式的结果
print(eval(a4))

#ASCII码 整数转化为字符的实质，转化为ASCII码的对应数值的字母
a5 = 65
b5 = 'A' #非数字的字符串不能用int()转化为数值,只能用ord()
print("将数字转化为字符：",chr(a5))
# print("将字符转化为数值：",int(b5))
print("将字符转化为数值：",ord(b5))

a6 = 1234
print("将十进制转化为十六进制：",hex(a6))
print("将十进制转化为八进制",oct(a6))

#用上述的方式实现抹零 12.8 = 13  12.2 = 12